# Напишите программу, которая считывает четыре целых положительных числа a, b, c, d и выводит на экран значение выражения a^b + c^d.

a = int(input())
b = int(input())
c = int(input())
d = int(input())

print(a**b + c**d)
