# Напишите программу, которая находит полное число метров по заданному числу сантиметров.

num1 = int(input())

num1 = num1 // 100

print(num1)
