# Напишите программу, вычисляющую объём куба и площадь его полной поверхности, по введённому значению длины ребра.

edge = int(input())

print('Объем =', edge**3)
print('Площадь полной поверхности =', 6 * edge**2)
