# Напишите программу, которая принимает целое число xx и определяет, принадлежит ли данное число указанному промежутку.

num = int(input())

if -1 < num < 17:
    print('Принадлежит')
else:
    print('Не принадлежит')