# Напишите программу, которая определяет наименьшее из двух чисел.

n1, n2 = int(input()), int(input())


if n1 > n2:
    print(n2)
else:
    print(n1)